class AllahNamesModel {
  String name;
  String description;
  AllahNamesModel({
    required this.name,
    required this.description,
  });

  static List<AllahNamesModel> allahNames = [
    AllahNamesModel(
      name: "الصبور",
      description:
          "هو الحليم الذي لا يعاجل العصاة بالنقمة، بل يعفو ويؤخر، ولا يسرع بالفعل قبل أوانه.",
    ),
    AllahNamesModel(
      name: "الرشيد",
      description:
          " هو الذي أسعد من شاء بإرشاده، وأشقى من شاء بإبعاده، عظيم الحكمة بالغ الرشاد.",
    ),
    AllahNamesModel(
      name: "الْوَارِثُ",
      description:
          "هو الأبقى الدائم الذي يرث الخلائق بعد فناء الخلق، وهو يرث الأرض ومن عليها.",
    ),
    AllahNamesModel(
      name: "الباقي",
      description:
          " هو وحده له البقاء، الدائم الوجود الموصوف بالبقاء الأزلي، غير قابل للفناء فهو الباقي بلا انتهاء.",
    ),
    AllahNamesModel(
      name: "الْبَدِيعُ",
      description:
          "هو الذي لا يماثله أحد في صفاته ولا في حكم من أحكامه، أو أمر من أموره، فهو المحدث الموجد على غير مثال.",
    ),
    AllahNamesModel(
      name: "الْهَادِي",
      description:
          "هو المبين للخلق طريق الحق بكلامه يهدي القلوب إلى معرفته، والنفوس إلى طاعته.",
    ),
    AllahNamesModel(
      name: "النُّورُ",
      description:
          "هو الهادي الرشيد الذي يرشد بهدايته من يشاء فيبين له الحق، ويلهمه اتباعه، الظاهر في ذاته، المظهر لغيره.",
    ),
    AllahNamesModel(
      name: "النافع",
      description:
          "هو المقدر النفع والخير لمن أراد كيف أراد كل ذلك على مقتضى حكمته سبحانه.",
    ),
    AllahNamesModel(
      name: "الضار",
      description: " هو المقدر للضر على من أراد كيف أراد",
    ),
    AllahNamesModel(
      name: "المانع",
      description: "هو الذي يمنع العطاء عن من يشاء ابتلاء أو حماية.",
    ),
    AllahNamesModel(
      name: "الْمُعْطِي",
      description: "هو الذي أعطى كل شيء.",
    ),
    AllahNamesModel(
      name: "المغني",
      description:
          "هو معطي الغنى لعباده، يغني من يشاء غناه، وهو الكافي لمن شاء من عباده.",
    ),
    AllahNamesModel(
      name: "الْغَنِيُّ",
      description:
          "هو الذي لا يحتاج إلى شيء، وهو المستغني عن كل ما سواه، المفتقر إليه كل من عاداه.",
    ),
    AllahNamesModel(
      name: "الْجَامِعُ",
      description:
          "هو الذي جمع الكمالات كلها، ذاتا ووصفا وفعلا، الذي يجمع بين الخلائق المتماثلة والمتباينة، والذي يجمع الأولين والآخرين.",
    ),
    AllahNamesModel(
      name: "المقسط",
      description:
          "هو العادل في حكمه، الذي ينتصف للمظلوم من الظالم، ثم يكمل عدله فيرضي الظالم بعد إرضاء المظلوم.",
    ),
    AllahNamesModel(
      name: "ذُو الْجَلَالِ والْإكْرَامِ",
      description:
          "هو المنفرد بصفات الجلال والكمال والعظمة، المختص بالإكرام والكرامة وهو أهل لأن يجل.",
    ),
    AllahNamesModel(
      name: "مَالِكُ الْمُلْكِ",
      description: "هو المتصرف في ملكه كيف يشاء لا راد لحكمه، ولا معقب لأمره.",
    ),
    AllahNamesModel(
      name: "الرَّؤُوفُ",
      description:
          "هو المتعطف على المذنبين بالتوبة، الذي جاد بلطفه ومَنَّ بتعطفه، يستر العيوب ثم يعفو عنها.",
    ),
    AllahNamesModel(
      name: "العَفُو",
      description:
          "هو الذي يترك المؤاخذة على الذنوب ولا يذكرك بالعيوب فهو يمحو السيئات ويتجاوز عن المعاصي.",
    ),
    AllahNamesModel(
      name: "الْمُنْتَقِمُ",
      description:
          " هو الذي يقصم ظهور الطغاة، ويشدد العقوبة على العصاة، وذلك بعد الإعذار والإنذار.",
    ),
    AllahNamesModel(
      name: "التَّوَّابُ",
      description:
          "هو الذي يوفق عباده للتوبة حتى يتوب عليهم ويقبل توبتهم فيقابل الدعاء بالعطاء، والتوبة بغفران الذنوب.",
    ),
    AllahNamesModel(
      name: "الْبَرُّ",
      description:
          "هو العطوف على عباده ببره ولطفه، ومن على السائلين بحسن عطائه، وهو الصدق فيما وعد.",
    ),
    AllahNamesModel(
      name: "الْمُتَعَالِ",
      description: " هو الذي جل عن إفك المفترين، وتنزه عن وساوس المتحيرين.",
    ),
    AllahNamesModel(
      name: "الوالي",
      description:
          "هو المالك للأشياء المتصرف فيها بمشيئته وحكمته، ينفذ فيها أمره، ويجري عليها حكمه.",
    ),
    AllahNamesModel(
      name: "الْبَاطِنُ",
      description:
          "هو العالم ببواطن الأمور وخفاياها، وهو أقرب إلينا من حبل الوريد.",
    ),
    AllahNamesModel(
      name: "الظَّاهِرُ",
      description:
          "هو الذي ظهر فوق كل شيء وعلا عليه، الظاهر وجوده لكثرة دلائله.",
    ),
    AllahNamesModel(
      name: "الْآخِرُ",
      description:
          "هو الباقي بعد فناء خلقه، البقاء الأبدي يفنى الكل وله البقاء وحده، فليس بعده شيء.",
    ),
    AllahNamesModel(
      name: "الْأَوَّلُ",
      description: "هو الذي لم يسبقه في الوجود شيء فهو أول قبل الوجود.",
    ),
    AllahNamesModel(
      name: "الْمُؤَخِّرُ",
      description:
          "هو الذي يؤخر الأشياء فيضعها في مواضعها المؤخر لمن شاء من الفجار والكفار وكل من يستحق التأخير.",
    ),
    AllahNamesModel(
      name: "الْمُقَدِّمُ",
      description:
          "هو الذي يقدم الأشياء ويضعها في مواضعها، فمن استحق التقديم قدمه.",
    ),
    AllahNamesModel(
      name: "الْمُقْتَدِرُ",
      description: "هو الذي يقدر على إصلاح الخلائق على وجه لا يقدر عليه غيره.",
    ),
    AllahNamesModel(
      name: "الْقَادِرُ",
      description:
          " هو الذي يقدر على إيجاد المعدوم وإعدام الموجود على قدر ما تقتضي الحكمة، لا زائدا عليه ولا ناقصا عنه.",
    ),
    AllahNamesModel(
      name: "الصَّمَدُ",
      description:
          " هو المطاع الذي لا يقضى دونه أمر، الذي يقصد إليه في الحوائج فهو مقصد عباده في مهمات دينهم ودنياهم.",
    ),
    AllahNamesModel(
      name: "الْوَاحِدُ",
      description:
          "هو الفرد المتفرد في ذاته وصفائه وأفعاله، واحد في ملكه لا ينازعه أحد، لا شريك له سبحانه.",
    ),
    AllahNamesModel(
      name: "الماجد",
      description:
          "هو الذي له الكمال المتناهي والعز الباهي، له العز في الأوصاف والأفعال الذي يعامل العباد بالجود والرحمة.",
    ),
    AllahNamesModel(
      name: "الواجد",
      description:
          "هو الذي لا يعوزه شيء ولا يعجزه شيء يجد كل ما يطلبه، ويدرك كل ما يريده.",
    ),
    AllahNamesModel(
      name: "الْقَيُّومُ",
      description:
          "هو القائم بنفسه، الغني عن غيره، وهو القائم بتدبير أمر خلقه في إنشائهم ورزقهم.",
    ),
    AllahNamesModel(
      name: "الْحَيُّ",
      description:
          "هو المتصف بالحياة الأبدية التي لا بداية لها ولا نهاية فهو الباقي أزلا وأبدا وهو الحي الذي لا يموت.",
    ),
    AllahNamesModel(
      name: "المميت",
      description:
          "هو مقدر الموت على كل من أماته ولا مميت سواه، قهر عباده بالموت متى شاء وكيف شاء.",
    ),
    AllahNamesModel(
      name: "المُحيي",
      description:
          " هو خالق الحياة ومعطيها لمن شاء، يحيي الخلق من العدم ثم يحييهم بعد الموت.",
    ),
    AllahNamesModel(
      name: "المعيد",
      description:
          " هو الذي يعيد الخلق بعد الحياة إلى الممات في الدنيا، وبعد الممات إلى الحياة يوم القيامة.",
    ),
    AllahNamesModel(
      name: "المبدئ",
      description: "هو الذي أنشأ الأشياء، واخترعها ابتداء من غير سابق مثال.",
    ),
    AllahNamesModel(
      name: "الْـمُحصِي",
      description: "هو الذي أحصى كل شيء بعلمه، فلا يفوته منها دقيق ولا جليل.",
    ),
    AllahNamesModel(
      name: "الْحَمِيدُ",
      description:
          "هو المستحق للحمد والثناء له منتهى الحمد وأطيبه على ذاته وصفاته وعلى نعمه التي لا تحصى.",
    ),
    AllahNamesModel(
      name: "الْوَلِيُّ",
      description:
          "هو المحب الناصر لمن أطاعه، ينصر أولياءه، ويقهر أعداءه، والمتولي الأمور الخلائق ويحفظهم.",
    ),
    AllahNamesModel(
      name: "الْمَتِينُ",
      description:
          "هو الشديد الذي لا يحتاج في إمضاء حكمه إلى جند أو مدد ولا إلى معين، فهو المتناهي في القوة، التي لا تلحق أفعاله مشقة، ولا يمسه فيها لغوب.",
    ),
    AllahNamesModel(
      name: "الْقَوِيّ",
      description:
          " هو صاحب القدرة التامة البالغة الكمال غالب لا يُغلب فقوته فوق كل قوة، ولا يرد قضاءه راد، ينفذ أمره، ويمضي قضاؤه في خلقه، شديد عقابه لمن كفر بآياته وجحد حججه.",
    ),
    AllahNamesModel(
      name: "الْوَكِيلُ",
      description:
          "هو الكفيل بالخلق القائم بأمورهم فمن توكل عليه تولاه وكفاه، ومن استغنى به أغناه وأرضاه.",
    ),
    AllahNamesModel(
      name: "الْحَقُّ",
      description:
          "هو الذي يحق الحق بكلماته ويؤيد أولياءه فهو المستحق للعبادة.",
    ),
    AllahNamesModel(
      name: "الشَّهِيدُ",
      description:
          "هو الحاضر الذي لا يغيب عنه شيء، فهو المطلع على كل شيء مشاهد له عليم بتفاصيله.",
    ),
    AllahNamesModel(
      name: "الباعث",
      description:
          "هو باعث الخلق يوم القيامة، وباعث رسله إلى العباد، وباعث المعونة إلى العبد.",
    ),
    AllahNamesModel(
      name: "الْمَجِيدُ",
      description:
          "هو الله تمجَّد بفعاله، ومجَّده خلقه لعظمته، والمجيد هو واسع الكرم، ووصف نفسه بالمجيد وهو متضمن كثرة صفات كماله وسعتها، وعدم إحصاء الخلق لها، وسعة أفعاله وكثرة خيره ودوامه. وتعني أيضاً البالغ النهاية في المجد، الكثير الإحسان الجزيل العطاء العظيم البر. تمجد.",
    ),
    AllahNamesModel(
      name: "الْوَدُودُ",
      description: "هو المحب لعباده، والمحبوب في قلوب أوليائه.",
    ),
    AllahNamesModel(
      name: "اَلْحَكِيمُ",
      description:
          "هو المحق في تدبيره اللطيف في تقديره الخبير بحقائق الأمور العليم بحكمه المقدور فجميع خلقه وقضاه خير وحكمة وعدل.",
    ),
    AllahNamesModel(
      name: "الْوَاسِعُ",
      description:
          " هو الذي وسع رزقه جميع خلقه، وسعت رحمته كل شيء المحيط بكل شيء.",
    ),
    AllahNamesModel(
      name: "الْمُجِيبُ",
      description:
          "هو الذي يجيب دعاء من دعاه، وسؤال من سأله، ويقابله بالعطاء والقبول، ولا يُسأل أحد سواه.",
    ),
    AllahNamesModel(
      name: "الرَّقِيبُ",
      description:
          "هو الرقيب الذي يراقب أحوال العباد ويعلم أقوالهم ويحصي أعمالهم وهو الحافظ الذي لا يغيب عنه شيء.",
    ),
    AllahNamesModel(
      name: "الْكَرِيمُ",
      description:
          "هو الكثير الخير الجواد المعطي الذي لا ينفد عطاؤه وهو الكريم المطلق الجامع لأنواع الخير والشرف والفضائل المحمود بفعاله.",
    ),
    AllahNamesModel(
      name: "الجليل",
      description:
          "هو العظيم المطلق المتصف بجميع صفات الكمال والمنعوت بكمالها المنزه عن كل نقص.",
    ),
    AllahNamesModel(
      name: "الْحَسِيبُ",
      description:
          "هو الكافي الذي منه كفاية العباد وهو الذي عليه الاعتماد يكفي العباد بفضله.",
    ),
    AllahNamesModel(
      name: "المُقِيت",
      description:
          "هو المتكفل بإيصال أقوات الخلق إليهم وهو الحفيظ والمقتدر والقدير والمقدر والممدد.",
    ),
    AllahNamesModel(
      name: "الْحَفِيظُ",
      description:
          "هو الذي لا يغرب عن حفظه شيء ولو كمثقال الذر فحفظه لا يتبدل ولا يزول ولا يعتريه التبديل.",
    ),
    AllahNamesModel(
      name: "الْكَبِيرُ",
      description:
          "هو العظيم الجليل ذو الكبرياء في صفاته وأفعاله فلا يحتاج إلى شيء ولا يعجزه شيء (ليس كمثله شيء).",
    ),
    AllahNamesModel(
      name: "الْعَلِيُّ",
      description:
          "هو الرفيع القدر فلا يحيط به وصف الواصفين المتعالي عن الأنداد والأضداد، فكل معاني العلو ثابتة له ذاتا وقهرا وشأنا.",
    ),
    AllahNamesModel(
      name: "الشَّكُورُ",
      description:
          "هو الذي يزكو عنده القليل من أعمال العباد، فيتقبلها ويضاعف أجرها.",
    ),
    AllahNamesModel(
      name: "الْغَفُورُ",
      description:
          " هو الساتر لذنوب عباده المتجاوز عن خطاياهم وذنوبهم. الفرق بين هذا الاسم واسم الغفار أن اسم الغفور يكون للدلالة على مغفرة الذنب مهما عظم ويأس صاحبه من المغفرة أما الغفار فتدل على مغفرة الله المستمرة للذنوب المختلفة لأن الإنسان خطاء فالله غفار.",
    ),
    AllahNamesModel(
      name: "الْعَظِيمُ",
      description:
          "هو العظيم في كل شيء، عظيم في ذاته وأسمائه وصفاته، عظيم في رحمته، عظيم في قدرته، عظيم في حكمته، عظيم في جبروته وكبريائه، عظيم في هبته وعطائه، عظيم في خبرته ولطفه، عظيم في بره وإحسانه، عظيم في عزته وعدله وحمده، فهو العظيم المطلق، فلا أحد يساويه، ولا عظيم يدانيه.",
    ),
    AllahNamesModel(
      name: "الْحَلِيمُ",
      description:
          "هو الصبور الذي يمهل ولا يهمل، ويستر الذنوب، ويؤخر العقوبة، فيرزق العاصي كما يرزق المطيع.",
    ),
    AllahNamesModel(
      name: "الْخَبِيرُ",
      description:
          "هو العليم بدقائق الأمور، لا تخفى عليه خافية، ولا يغيب عن علمه شيء فهو العالم بما كان ويكون.",
    ),
    AllahNamesModel(
      name: "اللَّطِيفُ",
      description:
          "هو البر الرفيق بعباده، يرزق وييسر ويحسن إليهم، ويرفق بهم ويتفضل عليهم.",
    ),
    AllahNamesModel(
      name: "العدل",
      description:
          " هو الذي حرم الظلم على نفسه، وجعله على عباده محرما، فهو المنزه عن الظلم والجور في أحكامه وأفعاله الذي يعطي كل ذي حق حقه.",
    ),
    AllahNamesModel(
      name: "الْحَكَم",
      description:
          "هو الذي يفصل بين مخلوقاته بما شاء ويفصل بين الحق والباطل لا راد لقضائه ولا معقب لحكمه.",
    ),
    AllahNamesModel(
      name: "الْبَصِير",
      description:
          "هو الذي يرى الأشياء كلها ظاهرها وباطنها وهو المحيط بكل شيء علماً.",
    ),
    AllahNamesModel(
      name: "السَّمِيعُ",
      description:
          "ومعناه سمعه لجميع الأصوات الظاهرة والباطنة الخفية والجلية، وإحاطته التامة بها، ومعناه أيضًا: سمع الإجابة منه للسائلين والداعين والعابدين فيجيبهم ويثيبهم.",
    ),
    AllahNamesModel(
      name: "المذل",
      description: "هو الذي ينزع القوة عمن يشاء فيذله.",
    ),
    AllahNamesModel(
      name: "المعز",
      description: "هو الذي يهب القوة والغلبة والشدة لمن شاء فيعزه",
    ),
    AllahNamesModel(
      name: "الرَّافِعُ",
      description:
          "هو الذي يرفع عباده المؤمنين بالطاعات ويرفعهم على عدوهم فينصرهم وهو رافع السماوات السبع.",
    ),
    AllahNamesModel(
      name: "الخافض",
      description:
          "هو الذي يخفض الأذلال لكل من طغى وتجبر وخرج على شريعته وتمرد",
    ),
    AllahNamesModel(
      name: "الْبَاسِطُ",
      description:
          "هو الذي يوسع الرزق لمن يشاء من عباده بجوده ورحمته فهو سبحانه القابض الباسط.",
    ),
    AllahNamesModel(
      name: "الْقَابِضُ",
      description: "هو الذي يقبض الرزق عمن يشاء من الخلق بعدله وحكمته",
    ),
    AllahNamesModel(
      name: "الْعَلِيم",
      description:
          "هو الذي يعلم تفاصيل الأمور، ودقائق الأشياء وخفايا الضمائر، والنفوس، لا يعزب عنه مثقال ذرة، فعلمه يحيط بجميع الأشياء.",
    ),
    AllahNamesModel(
      name: "الْفَتَّاح",
      description:
          "هو الذي يفتح مغلق الأمور، ويسهل العسير، وبيده مفاتيح السماوات والأرض.",
    ),
    AllahNamesModel(
      name: "الرَّزَّاق",
      description:
          "هو الذي خلق الأرزاق وأعطى كل الخلائق أرزاقها، ويمد كل كائن لما يحتاجه، ويحفظ عليه حياته ويصلحه.",
    ),
    AllahNamesModel(
      name: "الْوَهَّاب",
      description:
          "هو المنعم على العباد، الذي يهب بغير عوض ويعطي الحاجة بغير سؤال، كثير النعم، دائم العطاء.",
    ),
    AllahNamesModel(
      name: "الْقَهَّار",
      description:
          "هو الغالب الذي قهر خلقه بسلطانه وقدرته، وخضعت له الرقاب وذلت له الجبابرة، وصرف خلقه على ما أراد طوعا وكرها، وعنت الوجوه له.",
    ),
    AllahNamesModel(
      name: "اَلْغَفَّار",
      description: "هو وحده الذي يغفر الذنوب ويستر العيوب في الدنيا والآخرة.",
    ),
    AllahNamesModel(
      name: "الْمُصَوِّر",
      description:
          "هو الذي صور جميع الموجودات، ورتبها فأعطى كل شيء منها صورة خاصة، وهيئة منفردة، يتميز بها على اختلافها وكثرتها.",
    ),
    AllahNamesModel(
      name: "الْبَارِئ",
      description:
          "هو الذي خلق الخلق بقدرته لا عن مثال سابق، القادر على إبراز ما قدره إلى الوجود.",
    ),
    AllahNamesModel(
      name: "الْخَالِق",
      description:
          "هو الفاطر المبدع لكل شيء، والمقدر له والموجد للأشياء من العدم، فهو خالق كل صانع وصنعته.",
    ),
    AllahNamesModel(
      name: "الْمُتَكَبِّر",
      description: "هو المتعالي عن صفات الخلق المنفرد بالعظمة والكبرياء.",
    ),
    AllahNamesModel(
      name: "الْجَبَّار",
      description:
          "هو الذي تنفذ مشيئته، ولا يخرج أحد عن تقديره، وهو القاهر لخلقه على ما أراد.",
    ),
    AllahNamesModel(
      name: "الْعَزِيز",
      description:
          "هو المنفرد بالعزة، الظاهر الذي لا يقهر، القوي الممتنع فلا يغلبه شيء وهو غالب كل شيء.",
    ),
    AllahNamesModel(
      name: "الْمُهَيْمِن",
      description:
          "هو الرقيب الحافظ لكل شيء، القائم على خلقه بأعمالهم، وأرزاقهم وآجالهم، والمطلع على خفايا الأمور وخبايا الصدور.",
    ),
    AllahNamesModel(
      name: "المُؤْمِن",
      description: " هو الذي سلم أوليائه من عذابه، والذي يصدق عباده ما وعدهم.",
    ),
    AllahNamesModel(
      name: "السَّلَام",
      description:
          "هو ناشر السلام بين الأنام وهو الذي سلمت ذاته من النقص والعيب والفناء.",
    ),
    AllahNamesModel(
      name: "الْقُدُّوس",
      description:
          "هو الطاهر المنزه عن العيوب والنقائص وعن كل ما تحيط به العقول.",
    ),
    AllahNamesModel(
      name: "المَلِك",
      description:
          "هو الله، ملك الملوك، له الملك، وهو مالك يوم الدين، ومليك الخلق فهو المالك المطلق.",
    ),
    AllahNamesModel(
      name: "الرَّحِيم",
      description: "هو المنعم أبدا، المتفضل دوما، فرحمته لا تنتهي",
    ),
    AllahNamesModel(
      name: "الرَّحْمن",
      description:
          " كثير الرحمة وهو اسم مقصور على الله عز وجل ولا يجوز أن يقال رحمن لغير الله، وذلك لأن رحمته وسعت كل شيء وهو أرحم الراحمين.",
    ),
    AllahNamesModel(
      name: "الله",
      description:
          "وهو الاسم الأعظم الذي تفرد به الحق سبحانه وخص به نفسه وجعله أول أسمائه، وأضافها كلها إليه فهو علم على ذاته سبحانه.",
    ),
  ];
}
